import React from 'react';
import "./Blogs.css"

const Blogs = () => {
    return (
        <div className="display">
          <div className="box">
          <h1 className="text-2xl mt-5 text-teal-900">1)Context Api কি?</h1>
          উত্তর: কনটেক্সট এপিআই হল একটি রিঅ্যাক্ট স্ট্রাকচার যা অনন্য বিবরণ আদান-প্রদান করতে সক্ষম করে এবং অ্যাপ্লিকেশনের সমস্ত স্তর থেকে প্রপ-ড্রিলিং সমাধানে সহায়তা করে।
          </div>
          <div className="box">
          <h1 className="text-2xl mt-5 text-teal-900">2)Semantic Tag কি?</h1>
         উত্তর: শব্দার্থিক HTML ট্যাগগুলি সেই ট্যাগগুলির বিষয়বস্তু সম্পর্কে তথ্য প্রদান করে                 যেগুলি একটি পৃষ্ঠায় কীভাবে দেখায় তার বাইরে যায়৷ কোড ট্যাগে আবদ্ধ পাঠ্যটি অবিলম্বে                 ব্রাউজার দ্বারা কিছু ধরণের কোডিং ভাষা হিসাবে স্বীকৃত হয়। সেই কোডটি রেন্ডার করার চেষ্টা                 করার পরিবর্তে, ব্রাউজার বুঝতে পারে যে একটি নিবন্ধের উদ্দেশ্যে কোডের উদাহরণ হিসাবে সেই                 পাঠ্যটি ব্যবহার করছে৷
          </div>
        </div>
        
    );
};

export default Blogs;